===============================================================================
Parsing goal
===============================================================================
This is a
multiline _paragraph_

:::
This is a paragraph inside a div
:::

```gleam
let x = 2;
```

-------------------------------------------------------------------------------

(document
  (paragraph (emphasis))
  (div
    (div_marker)
    (paragraph)
    (div_marker))
  (code_block
    (code_block_marker)
    (language)
    (code)
    (code_block_marker)))

===============================================================================
Div: close contained elements
===============================================================================
:::
Top-level div

::::
A paragraph inside a second div,
both closed when the top-level div is closed
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (paragraph)
    (div
      (div_marker)
      (paragraph))
    (div_marker)))

===============================================================================
Div: divception
===============================================================================
:::::
:::
:::::::
Divception
:::


-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (div
      (div_marker)
      (div
        (div_marker)
        (paragraph))
    (div_marker))))

===============================================================================
Heading: Level 1
===============================================================================
# This is a heading


-------------------------------------------------------------------------------

(document
  (heading
    (heading_marker)))

===============================================================================
Heading: Level 2
===============================================================================
## Second level heading


-------------------------------------------------------------------------------

(document
  (heading
    (heading_marker)))

===============================================================================
Heading: Multiple levels
===============================================================================
# Level one


## Level two


### Level three


-------------------------------------------------------------------------------

(document
  (heading
    (heading_marker))
  (heading
    (heading_marker))
  (heading
    (heading_marker)))

===============================================================================
Heading: With emphasis
===============================================================================
# Heading with _emphasis_


-------------------------------------------------------------------------------

(document
  (heading
    (heading_marker)
    (emphasis)))

===============================================================================
Heading: Multiline
===============================================================================
# This is a heading
that spans multiple
lines


-------------------------------------------------------------------------------

(document
  (heading
    (heading_marker)))

===============================================================================
Heading: Multiline with hash markers
===============================================================================
# This is a heading
# that has hash markers
# on continuation lines


-------------------------------------------------------------------------------

(document
  (heading
    (heading_marker)))

===============================================================================
Heading: With attributes
===============================================================================
## Heading with ID


-------------------------------------------------------------------------------

(document
  (heading
    (heading_marker)))

===============================================================================
Heading: Level 6
===============================================================================
###### Deepest heading level


-------------------------------------------------------------------------------

(document
  (heading
    (heading_marker)))

===============================================================================
Thematic break: Stars
===============================================================================
Paragraph before

***

Paragraph after


-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))

===============================================================================
Thematic break: Dashes
===============================================================================
Paragraph before

---

Paragraph after


-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))

===============================================================================
Thematic break: Many stars
===============================================================================
Paragraph before

*******

Paragraph after


-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))

===============================================================================
Thematic break: With spaces
===============================================================================
Paragraph before

* * * * *

Paragraph after


-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))

===============================================================================
Thematic break: Indented
===============================================================================
Paragraph before

  ---

Paragraph after


-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))

===============================================================================
Block quote: Simple
===============================================================================
> This is a block quote


-------------------------------------------------------------------------------

(document
  (block_quote
    (paragraph)))

===============================================================================
Block quote: Multiple lines
===============================================================================
> First line
> Second line


-------------------------------------------------------------------------------

(document
  (block_quote
    (paragraph)))

===============================================================================
Block quote: With blank line
===============================================================================
> This is a quote
>
> More quote content


-------------------------------------------------------------------------------

(document
  (block_quote
    (paragraph)))

===============================================================================
Block quote: Lazy continuation
===============================================================================
> This is a block
quote with lazy continuation


-------------------------------------------------------------------------------

(document
  (block_quote
    (paragraph)))

===============================================================================
List: Bullet simple
===============================================================================
- Item one
- Item two
- Item three


-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (bullet_list_marker))
    (list_item
      (bullet_list_marker))
    (list_item
      (bullet_list_marker))))

===============================================================================
List: Ordered
===============================================================================
1. First item
2. Second item
3. Third item


-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (ordered_list_marker))
    (list_item
      (ordered_list_marker))
    (list_item
      (ordered_list_marker))))

===============================================================================
List: Task list
===============================================================================
- [ ] Unchecked task
- [x] Checked task
- [X] Also checked


-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (task_list_marker))
    (list_item
      (task_list_marker))
    (list_item
      (task_list_marker))))

===============================================================================
List: With inline formatting
===============================================================================
- Item with *strong* emphasis
- Item with _regular_ emphasis
- Item with `code`


-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (bullet_list_marker)
      (strong_emphasis))
    (list_item
      (bullet_list_marker)
      (emphasis))
    (list_item
      (bullet_list_marker)
      (verbatim))))

===============================================================================
List: Mixed bullet markers
===============================================================================
+ Plus item
* Star item


-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (bullet_list_marker))
    (list_item
      (bullet_list_marker))))

===============================================================================
Reference definition: Simple
===============================================================================
[ref]: http://example.com


-------------------------------------------------------------------------------

(document
  (reference_definition
    (reference_label)
    (reference_destination)))

===============================================================================
Reference definition: With attributes
===============================================================================
{title="Example"}
[ref]: http://example.com


-------------------------------------------------------------------------------

(document
  (reference_definition
    (attributes
      (attribute_key_value
        (attribute_key)
        (attribute_value_quoted)))
    (reference_label)
    (reference_destination)))

===============================================================================
Reference definition: Used by link
===============================================================================
[ref]: http://example.com

See [this link][ref] here


-------------------------------------------------------------------------------

(document
  (reference_definition
    (reference_label)
    (reference_destination))
  (paragraph
    (link
      (link_text)
      (link_label))))

===============================================================================
Code block
===============================================================================
```gleam
let x = 2;
```

-------------------------------------------------------------------------------

(document
  (code_block
    (code_block_marker)
    (language)
    (code)
    (code_block_marker)))

===============================================================================
Attributes: ID only
===============================================================================
:::{#myid}
Content
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (attributes
      (attribute_id))
    (paragraph)
    (div_marker)))

===============================================================================
Attributes: Class only
===============================================================================
:::{.myclass}
Content
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (attributes
      (attribute_class))
    (paragraph)
    (div_marker)))

===============================================================================
Attributes: Multiple classes
===============================================================================
:::{.class1 .class2 .class3}
Content
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (attributes
      (attribute_class)
      (attribute_class)
      (attribute_class))
    (paragraph)
    (div_marker)))

===============================================================================
Attributes: ID and class
===============================================================================
:::{#myid .myclass}
Content
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (attributes
      (attribute_id)
      (attribute_class))
    (paragraph)
    (div_marker)))

===============================================================================
Attributes: Key-value unquoted
===============================================================================
:::{key=value}
Content
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (attributes
      (attribute_key_value
        (attribute_key)
        (attribute_value_unquoted)))
    (paragraph)
    (div_marker)))

===============================================================================
Attributes: Key-value double quoted
===============================================================================
:::{key="value with spaces"}
Content
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (attributes
      (attribute_key_value
        (attribute_key)
        (attribute_value_quoted)))
    (paragraph)
    (div_marker)))

===============================================================================
Attributes: Key-value single quoted
===============================================================================
:::{key='value with spaces'}
Content
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (attributes
      (attribute_key_value
        (attribute_key)
        (attribute_value_quoted)))
    (paragraph)
    (div_marker)))

===============================================================================
Attributes: Mixed
===============================================================================
:::{#myid .class1 .class2 key1=value1 key2="value 2"}
Content
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (attributes
      (attribute_id)
      (attribute_class)
      (attribute_class)
      (attribute_key_value
        (attribute_key)
        (attribute_value_unquoted))
      (attribute_key_value
        (attribute_key)
        (attribute_value_quoted)))
    (paragraph)
    (div_marker)))

===============================================================================
Attributes: On code block
===============================================================================
```python{.highlight}
print("hello")
```

-------------------------------------------------------------------------------

(document
  (code_block
    (code_block_marker)
    (language)
    (attributes
      (attribute_class))
    (code)
    (code_block_marker)))

===============================================================================
Attributes: On emphasis
===============================================================================
This is _emphasized_{.highlight} text


-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (attributes
        (attribute_class)))))

===============================================================================
Paragraph: Single line
===============================================================================
Just a single line paragraph


-------------------------------------------------------------------------------

(document
  (paragraph))

===============================================================================
Paragraph: Multiple lines
===============================================================================
This is a paragraph
that spans multiple
lines without blank lines


-------------------------------------------------------------------------------

(document
  (paragraph))

===============================================================================
Paragraph: With multiple emphasis
===============================================================================
Text with _emphasis one_ and _emphasis two_


-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (emphasis))))

===============================================================================
Paragraph: Multiple paragraphs
===============================================================================
First paragraph


Second paragraph


Third paragraph


-------------------------------------------------------------------------------

(document
  (paragraph)
  (paragraph)
  (paragraph))

===============================================================================
Code block: No language
===============================================================================
```
code without language
```

-------------------------------------------------------------------------------

(document
  (code_block
    (code_block_marker)
    (code)
    (code_block_marker)))

===============================================================================
Code block: Empty
===============================================================================
```
```

-------------------------------------------------------------------------------

(document
  (code_block
    (code_block_marker)
    (code_block_marker)))

===============================================================================
Code block: Multiple lines
===============================================================================
```python
def hello():
    print("world")
    return True
```

-------------------------------------------------------------------------------

(document
  (code_block
    (code_block_marker)
    (language)
    (code)
    (code_block_marker)))

===============================================================================
Code block: With attributes on language
===============================================================================
```rust{#mycode .highlight line-numbers=true}
fn main() {
    println!("Hello");
}
```

-------------------------------------------------------------------------------

(document
  (code_block
    (code_block_marker)
    (language)
    (attributes
      (attribute_id)
      (attribute_class)
      (attribute_key_value
        (attribute_key)
        (attribute_value_unquoted)))
    (code)
    (code_block_marker)))

===============================================================================
Div: Empty
===============================================================================
:::
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (div_marker)))

===============================================================================
Div: Single paragraph
===============================================================================
:::
Single paragraph inside
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (paragraph)
    (div_marker)))

===============================================================================
Div: Multiple paragraphs
===============================================================================
:::
First paragraph


Second paragraph
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (paragraph)
    (paragraph)
    (div_marker)))

===============================================================================
Div: With code block
===============================================================================
:::
Some text

```python
code()
```

More text
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (paragraph)
    (code_block
      (code_block_marker)
      (language)
      (code)
      (code_block_marker))
    (paragraph)
    (div_marker)))

===============================================================================
Div: Nested with different lengths
===============================================================================
:::::
Outer div

:::
Inner div
:::

Back in outer
:::::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (paragraph)
    (div
      (div_marker)
      (paragraph)
      (div_marker))
    (paragraph)
    (div_marker)))

===============================================================================
Image: Inline simple
===============================================================================
This is an ![alt text](image.jpg) here


-------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description)
      (image_source))))

===============================================================================
Image: Reference with label
===============================================================================
This is an ![alt text][img-ref] here


-------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description)
      (image_reference))))

===============================================================================
Image: Reference empty label
===============================================================================
This is an ![cat][] here


-------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description))))

===============================================================================
Image: With attributes
===============================================================================
An image ![photo](pic.jpg){.centered} here


-------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description)
      (image_source)
      (attributes
        (attribute_class)))))

===============================================================================
Link: Inline simple
===============================================================================
This is a [link](http://example.com) here


-------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text)
      (link_destination))))

===============================================================================
Link: Inline with formatting
===============================================================================
This is a [link with _emphasis_](http://example.com) here


-------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (emphasis))
      (link_destination))))

===============================================================================
Link: Reference with label
===============================================================================
This is a [link][ref] here


-------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text)
      (link_label))))

===============================================================================
Link: Reference empty label
===============================================================================
This is a [link][] here


-------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text))))

===============================================================================
Link: Multiple links
===============================================================================
See [link one](http://one.com) and [link two](http://two.com) here


-------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text)
      (link_destination))
    (link
      (link_text)
      (link_destination))))

===============================================================================
Verbatim: Single backtick
===============================================================================
This is `verbatim code` text


-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim)))

===============================================================================
Verbatim: With backtick inside (double delimiter)
===============================================================================
This is ``code with ` backtick`` text


-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim)))

===============================================================================
Verbatim: Triple backticks
===============================================================================
Use ```triple `` backticks``` for this


-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim)))

===============================================================================
Verbatim: Multiple spans
===============================================================================
Use `code` and `more code` here


-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim)
    (verbatim)))

===============================================================================
Strong emphasis: Simple
===============================================================================
This is *strong emphasis* text


-------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis)))

===============================================================================
Strong emphasis: Multiple words
===============================================================================
This is *multiple strong words* in text


-------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis)))

===============================================================================
Strong emphasis: Multiple in line
===============================================================================
Start *first* middle *second* end


-------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (strong_emphasis))))

===============================================================================
Strong emphasis: With attributes
===============================================================================
This is *strong*{.highlight} text


-------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (attributes
        (attribute_class)))))

===============================================================================
Strong emphasis: Nested with emphasis
===============================================================================
This is *strong with _emphasis_ inside* text


-------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (emphasis))))

===============================================================================
Emphasis: Simple
===============================================================================
Simple _emphasis_ here


-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis)))

===============================================================================
Emphasis: Multiple words
===============================================================================
This is _multiple emphasized words_ in text


-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis)))

===============================================================================
Emphasis: Multiple in line
===============================================================================
Start _first_ middle _second_ end


-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (emphasis))))

===============================================================================
Emphasis: With underscore inside (not closing)
===============================================================================
This _has_underscore_ text


-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis)))

===============================================================================
Complex: Mixed blocks
===============================================================================
Paragraph one


:::
Div with paragraph

```js
code
```

Another paragraph
:::

Paragraph two


```python
more_code()
```

Final paragraph


-------------------------------------------------------------------------------

(document
  (paragraph)
  (div
    (div_marker)
    (paragraph)
    (code_block
      (code_block_marker)
      (language)
      (code)
      (code_block_marker))
    (paragraph)
    (div_marker))
  (paragraph)
  (code_block
    (code_block_marker)
    (language)
    (code)
    (code_block_marker))
  (paragraph))

