===============================================================================
Parsing goal
===============================================================================
This is a
multiline _paragraph_

:::
This is a paragraph inside a div
:::

```gleam
let x = 2;
```

-------------------------------------------------------------------------------

(document
  (paragraph (emphasis))
  (div
    (div_marker)
    (paragraph)
    (div_marker))
  (code_block
    (code_block_marker)
    (language)
    (code)
    (code_block_marker)))

===============================================================================
Div: close contained elements
===============================================================================
:::
Top-level div

::::
A paragraph inside a second div,
both closed when the top-level div is closed
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (paragraph)
    (div
      (div_marker)
      (paragraph))
    (div_marker)))

===============================================================================
Div: divception
===============================================================================
:::::
:::
:::::::
Divception
:::


-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (div
      (div_marker)
      (div
        (div_marker)
        (paragraph))
    (div_marker))))

===============================================================================
Heading: Level 1
===============================================================================
# This is a heading


-------------------------------------------------------------------------------

(document
  (heading
    (heading_marker)))

===============================================================================
Heading: Level 2
===============================================================================
## Second level heading


-------------------------------------------------------------------------------

(document
  (heading
    (heading_marker)))

===============================================================================
Heading: Multiple levels
===============================================================================
# Level one


## Level two


### Level three


-------------------------------------------------------------------------------

(document
  (heading
    (heading_marker))
  (heading
    (heading_marker))
  (heading
    (heading_marker)))

===============================================================================
Heading: With emphasis
===============================================================================
# Heading with _emphasis_


-------------------------------------------------------------------------------

(document
  (heading
    (heading_marker)
    (emphasis)))

===============================================================================
Heading: Multiline
===============================================================================
# This is a heading
that spans multiple
lines


-------------------------------------------------------------------------------

(document
  (heading
    (heading_marker)))

===============================================================================
Heading: Multiline with hash markers
===============================================================================
# This is a heading
# that has hash markers
# on continuation lines


-------------------------------------------------------------------------------

(document
  (heading
    (heading_marker)))

===============================================================================
Heading: With attributes
===============================================================================
## Heading with ID


-------------------------------------------------------------------------------

(document
  (heading
    (heading_marker)))

===============================================================================
Heading: Level 6
===============================================================================
###### Deepest heading level


-------------------------------------------------------------------------------

(document
  (heading
    (heading_marker)))

===============================================================================
Thematic break: Stars
===============================================================================
Paragraph before

***

Paragraph after


-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))

===============================================================================
Thematic break: Dashes
===============================================================================
Paragraph before

---

Paragraph after


-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))

===============================================================================
Thematic break: Many stars
===============================================================================
Paragraph before

*******

Paragraph after


-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))

===============================================================================
Thematic break: With spaces
===============================================================================
Paragraph before

* * * * *

Paragraph after


-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))

===============================================================================
Thematic break: Indented
===============================================================================
Paragraph before

  ---

Paragraph after


-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))

===============================================================================
Block quote: Simple
===============================================================================
> This is a block quote


-------------------------------------------------------------------------------

(document
  (block_quote
    (paragraph)))

===============================================================================
Block quote: Multiple lines
===============================================================================
> First line
> Second line


-------------------------------------------------------------------------------

(document
  (block_quote
    (paragraph)))

===============================================================================
Block quote: With blank line
===============================================================================
> This is a quote
>
> More quote content


-------------------------------------------------------------------------------

(document
  (block_quote
    (paragraph)))

===============================================================================
Block quote: Lazy continuation
===============================================================================
> This is a block
quote with lazy continuation


-------------------------------------------------------------------------------

(document
  (block_quote
    (paragraph)))

===============================================================================
List: Bullet simple
===============================================================================
- Item one
- Item two
- Item three


-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (bullet_list_marker))
    (list_item
      (bullet_list_marker))
    (list_item
      (bullet_list_marker))))

===============================================================================
List: Ordered
===============================================================================
1. First item
2. Second item
3. Third item


-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (ordered_list_marker))
    (list_item
      (ordered_list_marker))
    (list_item
      (ordered_list_marker))))

===============================================================================
List: Task list
===============================================================================
- [ ] Unchecked task
- [x] Checked task
- [X] Also checked


-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (task_list_marker))
    (list_item
      (task_list_marker))
    (list_item
      (task_list_marker))))

===============================================================================
List: With inline formatting
===============================================================================
- Item with *strong* emphasis
- Item with _regular_ emphasis
- Item with `code`


-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (bullet_list_marker)
      (strong_emphasis))
    (list_item
      (bullet_list_marker)
      (emphasis))
    (list_item
      (bullet_list_marker)
      (verbatim))))

===============================================================================
List: Mixed bullet markers
===============================================================================
+ Plus item
* Star item


-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (bullet_list_marker))
    (list_item
      (bullet_list_marker))))

===============================================================================
Pipe table: Simple
===============================================================================
| fruit  | price |
|--------|-------|
| apple  | 4     |
| banana | 10    |


-------------------------------------------------------------------------------

(document
  (pipe_table
    (pipe_table_row)
    (pipe_table_delimiter_row)
    (pipe_table_row)
    (pipe_table_row)))

===============================================================================
Pipe table: With alignment
===============================================================================
| left | center | right |
|:-----|:------:|------:|
| a    | b      | c     |


-------------------------------------------------------------------------------

(document
  (pipe_table
    (pipe_table_row)
    (pipe_table_delimiter_row)
    (pipe_table_row)))

===============================================================================
Pipe table: With caption
===============================================================================
| col1 | col2 |
|------|------|
| a    | b    |

^ This is the table caption


-------------------------------------------------------------------------------

(document
  (pipe_table
    (pipe_table_row)
    (pipe_table_delimiter_row)
    (pipe_table_row)
    (table_caption)))

===============================================================================
Reference definition: Simple
===============================================================================
[ref]: http://example.com


-------------------------------------------------------------------------------

(document
  (reference_definition
    (reference_label)
    (reference_destination)))

===============================================================================
Reference definition: With attributes
===============================================================================
{title="Example"}
[ref]: http://example.com


-------------------------------------------------------------------------------

(document
  (reference_definition
    (attributes
      (attribute_key_value
        (attribute_key)
        (attribute_value_quoted)))
    (reference_label)
    (reference_destination)))

===============================================================================
Reference definition: Used by link
===============================================================================
[ref]: http://example.com

See [this link][ref] here


-------------------------------------------------------------------------------

(document
  (reference_definition
    (reference_label)
    (reference_destination))
  (paragraph
    (link
      (link_text)
      (link_label))))

===============================================================================
Code block
===============================================================================
```gleam
let x = 2;
```

-------------------------------------------------------------------------------

(document
  (code_block
    (code_block_marker)
    (language)
    (code)
    (code_block_marker)))

===============================================================================
Attributes: ID only
===============================================================================
:::{#myid}
Content
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (attributes
      (attribute_id))
    (paragraph)
    (div_marker)))

===============================================================================
Attributes: Class only
===============================================================================
:::{.myclass}
Content
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (attributes
      (attribute_class))
    (paragraph)
    (div_marker)))

===============================================================================
Attributes: Multiple classes
===============================================================================
:::{.class1 .class2 .class3}
Content
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (attributes
      (attribute_class)
      (attribute_class)
      (attribute_class))
    (paragraph)
    (div_marker)))

===============================================================================
Attributes: ID and class
===============================================================================
:::{#myid .myclass}
Content
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (attributes
      (attribute_id)
      (attribute_class))
    (paragraph)
    (div_marker)))

===============================================================================
Attributes: Key-value unquoted
===============================================================================
:::{key=value}
Content
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (attributes
      (attribute_key_value
        (attribute_key)
        (attribute_value_unquoted)))
    (paragraph)
    (div_marker)))

===============================================================================
Attributes: Key-value double quoted
===============================================================================
:::{key="value with spaces"}
Content
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (attributes
      (attribute_key_value
        (attribute_key)
        (attribute_value_quoted)))
    (paragraph)
    (div_marker)))

===============================================================================
Attributes: Key-value single quoted
===============================================================================
:::{key='value with spaces'}
Content
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (attributes
      (attribute_key_value
        (attribute_key)
        (attribute_value_quoted)))
    (paragraph)
    (div_marker)))

===============================================================================
Attributes: Mixed
===============================================================================
:::{#myid .class1 .class2 key1=value1 key2="value 2"}
Content
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (attributes
      (attribute_id)
      (attribute_class)
      (attribute_class)
      (attribute_key_value
        (attribute_key)
        (attribute_value_unquoted))
      (attribute_key_value
        (attribute_key)
        (attribute_value_quoted)))
    (paragraph)
    (div_marker)))

===============================================================================
Attributes: On code block
===============================================================================
```python{.highlight}
print("hello")
```

-------------------------------------------------------------------------------

(document
  (code_block
    (code_block_marker)
    (language)
    (attributes
      (attribute_class))
    (code)
    (code_block_marker)))

===============================================================================
Attributes: On emphasis
===============================================================================
This is _emphasized_{.highlight} text


-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (attributes
        (attribute_class)))))

===============================================================================
Paragraph: Single line
===============================================================================
Just a single line paragraph


-------------------------------------------------------------------------------

(document
  (paragraph))

===============================================================================
Paragraph: Multiple lines
===============================================================================
This is a paragraph
that spans multiple
lines without blank lines


-------------------------------------------------------------------------------

(document
  (paragraph))

===============================================================================
Paragraph: With multiple emphasis
===============================================================================
Text with _emphasis one_ and _emphasis two_


-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (emphasis))))

===============================================================================
Paragraph: Multiple paragraphs
===============================================================================
First paragraph


Second paragraph


Third paragraph


-------------------------------------------------------------------------------

(document
  (paragraph)
  (paragraph)
  (paragraph))

===============================================================================
Code block: No language
===============================================================================
```
code without language
```

-------------------------------------------------------------------------------

(document
  (code_block
    (code_block_marker)
    (code)
    (code_block_marker)))

===============================================================================
Code block: Empty
===============================================================================
```
```

-------------------------------------------------------------------------------

(document
  (code_block
    (code_block_marker)
    (code_block_marker)))

===============================================================================
Code block: Multiple lines
===============================================================================
```python
def hello():
    print("world")
    return True
```

-------------------------------------------------------------------------------

(document
  (code_block
    (code_block_marker)
    (language)
    (code)
    (code_block_marker)))

===============================================================================
Code block: With attributes on language
===============================================================================
```rust{#mycode .highlight line-numbers=true}
fn main() {
    println!("Hello");
}
```

-------------------------------------------------------------------------------

(document
  (code_block
    (code_block_marker)
    (language)
    (attributes
      (attribute_id)
      (attribute_class)
      (attribute_key_value
        (attribute_key)
        (attribute_value_unquoted)))
    (code)
    (code_block_marker)))

===============================================================================
Div: Empty
===============================================================================
:::
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (div_marker)))

===============================================================================
Div: Single paragraph
===============================================================================
:::
Single paragraph inside
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (paragraph)
    (div_marker)))

===============================================================================
Div: Multiple paragraphs
===============================================================================
:::
First paragraph


Second paragraph
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (paragraph)
    (paragraph)
    (div_marker)))

===============================================================================
Div: With code block
===============================================================================
:::
Some text

```python
code()
```

More text
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (paragraph)
    (code_block
      (code_block_marker)
      (language)
      (code)
      (code_block_marker))
    (paragraph)
    (div_marker)))

===============================================================================
Div: Nested with different lengths
===============================================================================
:::::
Outer div

:::
Inner div
:::

Back in outer
:::::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker)
    (paragraph)
    (div
      (div_marker)
      (paragraph)
      (div_marker))
    (paragraph)
    (div_marker)))

===============================================================================
Insert: Simple
===============================================================================
My boss is {+nice+} text


-------------------------------------------------------------------------------

(document
  (paragraph
    (insert)))

===============================================================================
Delete: Simple
===============================================================================
My boss is {-mean-} text


-------------------------------------------------------------------------------

(document
  (paragraph
    (delete)))

===============================================================================
Insert and delete: Combined
===============================================================================
My boss is {-mean-}{+nice+} actually


-------------------------------------------------------------------------------

(document
  (paragraph
    (delete)
    (insert)))

===============================================================================
Superscript: Simple
===============================================================================
E = mc^2^ here


-------------------------------------------------------------------------------

(document
  (paragraph
    (superscript)))

===============================================================================
Subscript: Simple
===============================================================================
H~2~O formula


-------------------------------------------------------------------------------

(document
  (paragraph
    (subscript)))

===============================================================================
Superscript and subscript: Combined
===============================================================================
Text with x^2^ and H~2~O here


-------------------------------------------------------------------------------

(document
  (paragraph
    (superscript)
    (subscript)))

===============================================================================
Highlight: Simple
===============================================================================
This is {=highlighted text=} here


-------------------------------------------------------------------------------

(document
  (paragraph
    (highlight)))

===============================================================================
Highlight: With formatting
===============================================================================
This is {=highlighted *strong* text=} here


-------------------------------------------------------------------------------

(document
  (paragraph
    (highlight
      (strong_emphasis))))

===============================================================================
Highlight: Multiple
===============================================================================
Text with {=first=} and {=second=} highlights


-------------------------------------------------------------------------------

(document
  (paragraph
    (highlight)
    (highlight)))

===============================================================================
Autolink: URL
===============================================================================
Visit <https://example.com> for info


-------------------------------------------------------------------------------

(document
  (paragraph
    (autolink)))

===============================================================================
Autolink: Email
===============================================================================
Contact <user@example.com> here


-------------------------------------------------------------------------------

(document
  (paragraph
    (autolink)))

===============================================================================
Autolink: Multiple
===============================================================================
See <https://one.com> and <https://two.com> sites


-------------------------------------------------------------------------------

(document
  (paragraph
    (autolink)
    (autolink)))

===============================================================================
Image: Inline simple
===============================================================================
This is an ![alt text](image.jpg) here


-------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description)
      (image_source))))

===============================================================================
Image: Reference with label
===============================================================================
This is an ![alt text][img-ref] here


-------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description)
      (image_reference))))

===============================================================================
Image: Reference empty label
===============================================================================
This is an ![cat][] here


-------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description))))

===============================================================================
Image: With attributes
===============================================================================
An image ![photo](pic.jpg){.centered} here


-------------------------------------------------------------------------------

(document
  (paragraph
    (image
      (image_description)
      (image_source)
      (attributes
        (attribute_class)))))

===============================================================================
Link: Inline simple
===============================================================================
This is a [link](http://example.com) here


-------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text)
      (link_destination))))

===============================================================================
Link: Inline with formatting
===============================================================================
This is a [link with _emphasis_](http://example.com) here


-------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text
        (emphasis))
      (link_destination))))

===============================================================================
Link: Reference with label
===============================================================================
This is a [link][ref] here


-------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text)
      (link_label))))

===============================================================================
Link: Reference empty label
===============================================================================
This is a [link][] here


-------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text))))

===============================================================================
Link: Multiple links
===============================================================================
See [link one](http://one.com) and [link two](http://two.com) here


-------------------------------------------------------------------------------

(document
  (paragraph
    (link
      (link_text)
      (link_destination))
    (link
      (link_text)
      (link_destination))))

===============================================================================
Verbatim: Single backtick
===============================================================================
This is `verbatim code` text


-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim)))

===============================================================================
Verbatim: With backtick inside (double delimiter)
===============================================================================
This is ``code with ` backtick`` text


-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim)))

===============================================================================
Verbatim: Triple backticks
===============================================================================
Use ```triple `` backticks``` for this


-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim)))

===============================================================================
Verbatim: Multiple spans
===============================================================================
Use `code` and `more code` here


-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim)
    (verbatim)))

===============================================================================
Strong emphasis: Simple
===============================================================================
This is *strong emphasis* text


-------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis)))

===============================================================================
Strong emphasis: Multiple words
===============================================================================
This is *multiple strong words* in text


-------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis)))

===============================================================================
Strong emphasis: Multiple in line
===============================================================================
Start *first* middle *second* end


-------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (strong_emphasis))))

===============================================================================
Strong emphasis: With attributes
===============================================================================
This is *strong*{.highlight} text


-------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (attributes
        (attribute_class)))))

===============================================================================
Strong emphasis: Nested with emphasis
===============================================================================
This is *strong with _emphasis_ inside* text


-------------------------------------------------------------------------------

(document
  (paragraph
    (strong_emphasis
      (emphasis))))

===============================================================================
Emphasis: Simple
===============================================================================
Simple _emphasis_ here


-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis)))

===============================================================================
Emphasis: Multiple words
===============================================================================
This is _multiple emphasized words_ in text


-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis)))

===============================================================================
Emphasis: Multiple in line
===============================================================================
Start _first_ middle _second_ end


-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (emphasis))))

===============================================================================
Emphasis: With underscore inside (not closing)
===============================================================================
This _has_underscore_ text


-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis)))

===============================================================================
Complex: Mixed blocks
===============================================================================
Paragraph one


:::
Div with paragraph

```js
code
```

Another paragraph
:::

Paragraph two


```python
more_code()
```

Final paragraph


-------------------------------------------------------------------------------

(document
  (paragraph)
  (div
    (div_marker)
    (paragraph)
    (code_block
      (code_block_marker)
      (language)
      (code)
      (code_block_marker))
    (paragraph)
    (div_marker))
  (paragraph)
    (code_block
      (code_block_marker)
      (language)
      (code)
      (code_block_marker))
  (paragraph))

===============================================================================
Line breaks: Basic hard line break
===============================================================================
This line has a hard break\
and continues here.


-------------------------------------------------------------------------------

(document
  (paragraph
    (line_break)))

===============================================================================
Line breaks: Multiple line breaks in paragraph
===============================================================================
First line\
Second line\
Third line.


-------------------------------------------------------------------------------

(document
  (paragraph
    (line_break)
    (line_break)))

===============================================================================
Line breaks: With inline formatting
===============================================================================
This has _emphasis_\
and *strong* text\
across breaks.


-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis)
    (line_break)
    (strong_emphasis)
    (line_break)))

===============================================================================
Line breaks: At end of paragraph
===============================================================================
Single line paragraph\


-------------------------------------------------------------------------------

(document
  (paragraph
    (line_break)))

===============================================================================
Raw blocks: HTML
===============================================================================
``` =html
<div class="custom">
  <p>Raw HTML content</p>
</div>
```

-------------------------------------------------------------------------------

(document
  (raw_block
    (code_block_marker)
    (raw_format)
    (code)
    (code_block_marker)))

===============================================================================
Raw blocks: LaTeX
===============================================================================
``` =latex
\begin{equation}
  E = mc^2
\end{equation}
```

-------------------------------------------------------------------------------

(document
  (raw_block
    (code_block_marker)
    (raw_format)
    (code)
    (code_block_marker)))

===============================================================================
Raw blocks: With attributes
===============================================================================
``` =html {#custom .raw-content}
<span>Content</span>
```

-------------------------------------------------------------------------------

(document
  (raw_block
    (code_block_marker)
    (raw_format)
    (attributes
      (attribute_id)
      (attribute_class))
    (code)
    (code_block_marker)))

===============================================================================
Raw blocks: Empty
===============================================================================
``` =html
```

-------------------------------------------------------------------------------

(document
  (raw_block
    (code_block_marker)
    (raw_format)
    (code_block_marker)))

===============================================================================
Spans: With class
===============================================================================
This is [special text]{.highlight}.


-------------------------------------------------------------------------------

(document
  (paragraph
    (span
      (span_text)
      (attribute_class))))

===============================================================================
Spans: With ID and class
===============================================================================
The [main section]{#intro .section} starts here.


-------------------------------------------------------------------------------

(document
  (paragraph
    (span
      (span_text)
      (attribute_id)
      (attribute_class))))

===============================================================================
Spans: With key-value attributes
===============================================================================
A [custom element]{lang=en dir=ltr}.


-------------------------------------------------------------------------------

(document
  (paragraph
    (span
      (span_text)
      (attribute_key_value
        (attribute_key)
        (attribute_value_unquoted))
      (attribute_key_value
        (attribute_key)
        (attribute_value_unquoted)))))

===============================================================================
Spans: With inline formatting
===============================================================================
This is [_emphasized_ and *strong*]{.note}.


-------------------------------------------------------------------------------

(document
  (paragraph
    (span
      (span_text
        (emphasis)
        (strong_emphasis))
      (attribute_class))))

===============================================================================
Spans: Multiple spans
===============================================================================
First [span]{.a} and [second]{.b} here.


-------------------------------------------------------------------------------

(document
  (paragraph
    (span
      (span_text)
      (attribute_class))
    (span
      (span_text)
      (attribute_class))))

===============================================================================
Math: Inline simple
===============================================================================
The equation $`x = 1` is simple.


-------------------------------------------------------------------------------

(document
  (paragraph
    (math)))

===============================================================================
Math: Display simple
===============================================================================
The equation $$`E = mc^2` is famous.


-------------------------------------------------------------------------------

(document
  (paragraph
    (math)))

===============================================================================
Math: With complex expression
===============================================================================
Formula: $`\frac{a}{b} + \sqrt{c}` here.


-------------------------------------------------------------------------------

(document
  (paragraph
    (math)))

===============================================================================
Math: Multiple in line
===============================================================================
Both $`x` and $`y` are variables.


-------------------------------------------------------------------------------

(document
  (paragraph
    (math)
    (math)))

===============================================================================
Math: Double backticks
===============================================================================
Using $$``E = mc^2`` for display.


-------------------------------------------------------------------------------

(document
  (paragraph
    (math)))

===============================================================================
Footnote reference: Simple
===============================================================================
This is a statement[^1].


-------------------------------------------------------------------------------

(document
  (paragraph
    (footnote_reference)))

===============================================================================
Footnote reference: With label
===============================================================================
See reference[^note-label] for details.


-------------------------------------------------------------------------------

(document
  (paragraph
    (footnote_reference)))

===============================================================================
Footnote reference: Multiple
===============================================================================
First[^1] and second[^2] references.


-------------------------------------------------------------------------------

(document
  (paragraph
    (footnote_reference)
    (footnote_reference)))

===============================================================================
Footnote reference: With numbers and text
===============================================================================
Check footnote[^ref123] here.


-------------------------------------------------------------------------------

(document
  (paragraph
    (footnote_reference)))

===============================================================================
Symbols: Simple emoji
===============================================================================
I love :smile: emoji!


-------------------------------------------------------------------------------

(document
  (paragraph
    (symbol)))

===============================================================================
Symbols: With underscores
===============================================================================
Use :arrow_right: for navigation.


-------------------------------------------------------------------------------

(document
  (paragraph
    (symbol)))

===============================================================================
Symbols: With hyphens
===============================================================================
Check the :left-arrow: symbol.


-------------------------------------------------------------------------------

(document
  (paragraph
    (symbol)))

===============================================================================
Symbols: Multiple
===============================================================================
Both :star: and :heart: symbols.


-------------------------------------------------------------------------------

(document
  (paragraph
    (symbol)
    (symbol)))

===============================================================================
Symbols: With numbers
===============================================================================
Symbol :test123: works.


-------------------------------------------------------------------------------

(document
  (paragraph
    (symbol)))

